Revit 2026 API

# PropertySetElementGetStructuralAsset Method

---

Gets a copy of the StructuralAsset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StructuralAsset GetStructuralAsset()
```
```vb
Public Function GetStructuralAsset As StructuralAsset
```
```cpp
public:
StructuralAsset^ GetStructuralAsset()
```
```fsharp
member GetStructuralAsset : unit -> StructuralAsset
```

#### Return Value

StructuralAsset

#### Reference

PropertySetElement Class

Autodesk.Revit.DB Namespace